Revit 2024 API
BuiltInFailures.ElectricalFailures.MismatchNmbOfPolesToCircuit Property
 Cannot add [Element] to Circuit. The Number of Poles for [Element] does not match the Number of Poles ([Name]) for the Circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MismatchNmbOfPolesToCircuit { get; }
Visual Basic
Public Shared ReadOnly Property MismatchNmbOfPolesToCircuit As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MismatchNmbOfPolesToCircuit {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace